In [1]:
import mysql.connector

In [2]:
# 连接到 MySQL 服务器
conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="123456"
)
cursor = conn.cursor()

In [3]:
# 创建数据库并使用
cursor.execute("CREATE DATABASE IF NOT EXISTS school")
cursor.execute("USE school;")

In [4]:
# 创建学生表 student
create_student_table = """
CREATE TABLE IF NOT EXISTS student (
    Sno VARCHAR(10) PRIMARY KEY COMMENT '学号，主键',
    Sname VARCHAR(50) NOT NULL COMMENT '姓名',
    Ssex VARCHAR(10) NOT NULL COMMENT '性别',
    Sage INT NOT NULL COMMENT '年龄',
    Sdept VARCHAR(50) NOT NULL COMMENT '所在系别'
) COMMENT '学生表';
"""
cursor.execute(create_student_table)

In [5]:
# 查看表
cursor.execute("show tables;")
print(cursor.fetchall())

[('student',)]

In [8]:
cursor.execute("ALTER TABLE student MODIFY COLUMN Sno VARCHAR(50);")

In [9]:
# 插入学生表数据
students = [
    ("202205325115", "王孔昊", "男", 21, "CS"),
    ("202205325116", "王译史", "男", 21, "CS"),
    ("202205325114", "童遵员", "男", 21, "CS"),
    ("202205325113", "李卓凡", "男", 21, "CS"),
    ("202205325117", "同学4", "男", 21, "CS"),
]
cursor.executemany(
    "INSERT INTO student (Sno, Sname, Ssex, Sage, Sdept) VALUES (%s, %s, %s, %s, %s) ON DUPLICATE KEY UPDATE Sname=VALUES(Sname);",
    students,
)

In [20]:
cursor.execute("SELECT * FROM student;")
print(cursor.fetchall())

[('202205325113', '李卓凡', '男', 21, 'CS'), ('202205325114', '童遵员', '男', 21, 'CS'), ('202205325115', '王孔昊', '男', 21, 'CS'), ('202205325116', '王译史', '男', 21, 'CS'), ('202205325117', '同学4', '男', 21, 'CS')]

In [11]:
# 创建课程表 course
create_course_table = """
CREATE TABLE IF NOT EXISTS course (
    Cno VARCHAR(10) PRIMARY KEY COMMENT '课程编号，主键',
    Cname VARCHAR(50) NOT NULL COMMENT '课程名称',
    Credit INT NOT NULL COMMENT '课程学分'
) COMMENT '课程表';
"""
cursor.execute(create_course_table)

In [13]:
# 查看表
cursor.execute("show tables;")
print(cursor.fetchall())

[('course',), ('student',)]

In [14]:
# 插入课程表数据
courses = [
    ("00001", "DataBase", 4),
    ("00002", "DataStructure", 4),
    ("00003", "Algorithms", 3),
    ("00004", "OperatingSystems", 5),
    ("00005", "ComputerNetwork", 4),
]
cursor.executemany(
    "INSERT INTO course (Cno, Cname, Credit) VALUES (%s, %s, %s) ON DUPLICATE KEY UPDATE Cname=VALUES(Cname);",
    courses,
)

In [15]:
cursor.execute("SELECT * FROM course;")
print(cursor.fetchall())

[('00001', 'DataBase', 4), ('00002', 'DataStructure', 4), ('00003', 'Algorithms', 3), ('00004', 'OperatingSystems', 5), ('00005', 'ComputerNetwork', 4)]

In [17]:
# 创建选课表 sc
create_sc_table = """
CREATE TABLE IF NOT EXISTS sc (
    Sno VARCHAR(50) NOT NULL COMMENT '学生学号',
    Cno VARCHAR(10) NOT NULL COMMENT '课程编号',
    Grade INT NOT NULL COMMENT '成绩',
    PRIMARY KEY (Sno, Cno),
    FOREIGN KEY (Sno) REFERENCES student(Sno) ON DELETE CASCADE ON UPDATE CASCADE,
    FOREIGN KEY (Cno) REFERENCES course(Cno) ON DELETE CASCADE ON UPDATE CASCADE
) COMMENT '选课表';
"""
cursor.execute(create_sc_table)

In [22]:
cursor.execute("ALTER TABLE sc MODIFY COLUMN Sno VARCHAR(50);")

In [18]:
# 查看表
cursor.execute("show tables;")
print(cursor.fetchall())

[('course',), ('sc',), ('student',)]

In [23]:
# 插入选课表数据
sc_records = [
    ("202205325115", "00003", 86),
    ("202205325116", "00002", 90),
    ("202205325114", "00004", 70),
    ("202205325113", "00001", 85),
    ("202205325117", "00002", 77),
    ("202205325115", "00003", 88),
]
cursor.executemany(
    "INSERT INTO sc (Sno, Cno, Grade) VALUES (%s, %s, %s) ON DUPLICATE KEY UPDATE Grade=VALUES(Grade);",
    sc_records,
)

In [24]:
cursor.execute("SELECT * FROM sc;")
print(cursor.fetchall())

[('202205325113', '00001', 85), ('202205325114', '00004', 70), ('202205325115', '00003', 88), ('202205325116', '00002', 90), ('202205325117', '00002', 77)]